zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_srom.c
/***************************************************************************//**
* \file cy_flash_srom.c
* \version 3.150.1
*
* \brief
* Provides functions for controlling the SROM APIs.
*
********************************************************************************
* \copyright
* (c) 2021-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"
#if defined (CY_IP_MXFLASHC_VERSION_ECT)
#include "cy_flash_srom.h"
#include "cy_ipc_drv.h"

CY_SECTION_SHAREDMEM
CY_ALIGN(32) static un_srom_api_scrach_sram_t g_scratch; // This must locate on SRAM.
CY_SECTION_SHAREDMEM
CY_ALIGN(32) static un_srom_api_args_2_t      g_scratch2; // This must locate on SRAM.
static uint32_t message[2];
static cy_srom_handler gp_srom_resp_handler = NULL;

static void Cy_Srom_ISR_ResponseIPC(void);
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
static uint32_t Cy_Srom_Get_DataSize(cy_en_programrow_datasize_t size);
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
/*******************************************************************************
* Function Name: Cy_Srom_CallApi
****************************************************************************//**
*
* This function calls SROM API. CPU will wait for API completed inside this
* function by checking IPC released. Even after checking 0x00FFFFFF times, if it
* is still not released, this function will return timeout status.
* If IPC was busy when this function was called, it would return busy status
* immediately.
* If SROM API returned error status, this function would return error status.
* But actual message is still in first word of memory pointed by second input
* parameter "resp" (if not NULL).
* All messages will be passed via SRAM pointed to scratch address. The SRAM area
* is reserved in this file as a variable named "g_scratch".
* This function is not re-entrant.
*
* \param params
* Pointer to memory which contains SROM API arguments. The contents of arguments
* will be copied to "g_scratch". \ref un_srom_api_args_t
*
* \param resp
* Pointer to memory which SROM API response message will be copied to. Even if
* this function return error status, response message will be copied to the
* memory. If pointer is NULL, response will not be copied \ref un_srom_api_resps_t
*
* \return
* \ref cy_en_srom_driver_status_t
*
*******************************************************************************/
cy_en_srom_driver_status_t Cy_Srom_CallApi(const un_srom_api_args_t* params, un_srom_api_resps_t* resp)
{
    if(params == NULL)
    {
        return CY_SROM_DR_INVALID_INPUT;
    }

    IPC_STRUCT_Type* syscall_ipc_struct = Cy_IPC_Drv_GetIpcBaseAddress((uint32_t)CY_IPC_CHAN_SYSCALL);
    uint32_t timeOut = 0x0FFFFFFFUL;

    // Copy input contents to SRAM reserved
    g_scratch.args = *params;

    // Make Bit[0] to 0, it indicates all arguments are passed through scratch address
    g_scratch.u32[0] = g_scratch.u32[0] & 0xFFFFFFFEUL;

#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
    uint32_t size_in_bytes = Cy_Srom_Get_DataSize((cy_en_programrow_datasize_t)(params->ProgramRow.arg1.dataSize));
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 3, \
'Checked manually. Intentional expression The object pointer of type non "uint32_t *" is cast to type "uint32_t *".')

    SCB_CleanDCache_by_Addr((uint32_t*)&g_scratch, (int32_t)sizeof(g_scratch));
    SCB_CleanDCache_by_Addr((uint32_t*)params->ProgramRow.arg3.srcAddr, (int32_t)size_in_bytes);

    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
    // Send message by IPC
    if (Cy_IPC_Drv_SendMsgWord(syscall_ipc_struct, CY_SROM_DR_IPC_NOTIFY_STRUCT, (uint32_t)&g_scratch) != CY_IPC_DRV_SUCCESS)
    {
        // The IPC structure is already locked by another process
        return CY_SROM_DR_IPC_BUSY;
    }
    while(true)
    {
        // Checks if the IPC structure is not locked
        if (Cy_IPC_Drv_IsLockAcquired(syscall_ipc_struct) == false)
        {
            // The result of SROM API calling is in the SRAM reserved.
            // Copy the contents to the memory pointed by input pointer
            if(resp != NULL)
            {
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
                CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 1, \
'Checked manually. Intentional expression The object pointer of type non "uint32_t *" is cast to type "uint32_t *".')
                SCB_InvalidateDCache_by_Addr ((uint32_t*)&g_scratch, (int32_t)sizeof(g_scratch));
                SCB_InvalidateDCache_by_Addr ((uint32_t*)params->ProgramRow.arg2.dstAddr, (int32_t)size_in_bytes);
                CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
                *resp = g_scratch.resps;
            }
            break;
        }

        // Decrement time out counter value
        timeOut--;

        // If time out counter is "0" return time out status
        if(timeOut == 0U)
        {
            return CY_SROM_DR_TIMEOUT;
        }
    }

    if(Cy_Srom_GetResponseType() == CY_SROM_RESPONSE_FAIL)
    {
        // If the SROM API returned an error in the scratch RAM, return error
        return CY_SROM_DR_API_ERROR;
    }
    else if(Cy_Srom_GetResponseType() == CY_SROM_RESPONSE_SUCCESS)
    {
        // If the SROM API returned "OK", return success
        return CY_SROM_DR_SUCCEEDED;
    }
    else
    {
        // Return unknown status
        return CY_SROM_DR_API_UNKNOWN;
    }
}

