zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_srom.c
/*******************************************************************************
* Function Name: Cy_Srom_CallApi_NonBlock
****************************************************************************//**
*
* This function calls SROM API. CPU "won't" wait for API completed inside this
* function by checking IPC released.
* If IPC was busy when this function was called, it would return busy status
* immediately.
* Please call "Cy_Srom_Get_Api_Response" to retrieve API response.
* All messages will be passed via SRAM pointed to scratch address. The SRAM area
* is reserved in this file as a variable named "g_scratch".
* This function is not re-entrant.
* Once user called this function, this function and also "Cy_Srom_CallApi"
* must not called until SROM API finished.
*
* \param params
* Pointer to memory which contains SROM API arguments. The contents of arguments
* will be copied to "g_scratch". \ref un_srom_api_args_t
*
* \return
* \ref cy_en_srom_driver_status_t
*
*******************************************************************************/
cy_en_srom_driver_status_t Cy_Srom_CallApi_NonBlock(const un_srom_api_args_t* params)
{
    if(params == NULL)
    {
        return CY_SROM_DR_INVALID_INPUT;
    }
    IPC_STRUCT_Type* syscall_ipc_struct = Cy_IPC_Drv_GetIpcBaseAddress((uint32_t)CY_IPC_CHAN_SYSCALL);
    uint32_t timeOut = 0x0FFFFFFFUL;

    // Copy input contents to SRAM reserved
    g_scratch.args = *params;

    // Make Bit[0] to 0, it indicates all arguments are passed through scratch address
    g_scratch.u32[0] = g_scratch.u32[0] & 0xFFFFFFFEUL;

#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
    uint32_t size_in_bytes = Cy_Srom_Get_DataSize((cy_en_programrow_datasize_t)(params->ProgramRow.arg1.dataSize));
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 3, \
'Checked manually. Intentional expression The object pointer of type non "uint32_t *" is cast to type "uint32_t *".')
    SCB_CleanDCache_by_Addr((uint32_t*)&g_scratch, (int32_t)sizeof(g_scratch));
    SCB_CleanDCache_by_Addr((uint32_t*)params->ProgramRow.arg3.srcAddr, (int32_t)size_in_bytes);

    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
    // Send message by IPC
    if (Cy_IPC_Drv_SendMsgWord(syscall_ipc_struct, CY_SROM_DR_IPC_NOTIFY_STRUCT, (uint32_t)&g_scratch) != CY_IPC_DRV_SUCCESS)
    {
        // The IPC structure is already locked by another process
        return CY_SROM_DR_IPC_BUSY;
    }
    while(true)
   {
       // Checks if the IPC structure is not locked
       if (Cy_IPC_Drv_IsLockAcquired(syscall_ipc_struct) == false)
       {
           // The result of SROM API calling is in the SRAM reserved.
           // Copy the contents to the memory pointed by input pointer
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
                CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 1, \
'Checked manually. Intentional expression The object pointer of type non "uint32_t *" is cast to type "uint32_t *".')
                SCB_InvalidateDCache_by_Addr ((uint32_t*)params->ProgramRow.arg2.dstAddr, (int32_t)size_in_bytes);
                CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
           break;
       }
       // Decrement time out counter value
       timeOut--;

       // If time out counter is "0" return time out status
       if(timeOut == 0U)
       {
           return CY_SROM_DR_TIMEOUT;
       }
   }

    // Check SROM response after IPC release to catch parameter validation errors
    // (e.g. invalid flash address) before reporting success
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 1, \
'Checked manually. Intentional expression The object pointer of type non "uint32_t *" is cast to type "uint32_t *".')
    SCB_InvalidateDCache_by_Addr ((uint32_t*)&g_scratch, (int32_t)sizeof(g_scratch));
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */

    if(Cy_Srom_GetResponseType() == CY_SROM_RESPONSE_FAIL)
    {
        return CY_SROM_DR_API_ERROR;
    }
    else if(Cy_Srom_GetResponseType() == CY_SROM_RESPONSE_SUCCESS)
    {
        return CY_SROM_DR_SUCCEEDED;
    }
    else
    {
        return CY_SROM_DR_API_UNKNOWN;
    }
}

/*******************************************************************************
* Function Name: Cy_Srom_CallApi_2
****************************************************************************//**
*
* This function calls SROM API which need also IPC DATA1. Other is same as
* "Cy_SROM_CallApi"
*
* \param params
* Pointer to memory which contains SROM API arguments. The contents of arguments
* will be copied to "g_scratch". \ref un_srom_api_args_t
*
* \param params
* Pointer to memory which contains SROM API arguments 2. The contents of arguments
* will be copied to "g_scratch2". \ref un_srom_api_args_2_t
*
* \param resp
* Pointer to memory which SROM API response message will be copied to. Even if
* this function return error status, response message will be copied to the
* memory. If pointer is NULL, response will not be copied \ref un_srom_api_resps_t
*
* \return
* \ref cy_en_srom_driver_status_t
*
*******************************************************************************/
cy_en_srom_driver_status_t Cy_Srom_CallApi_2(const un_srom_api_args_t* params, const un_srom_api_args_2_t* params2, un_srom_api_resps_t* resp)
{
    if((params == NULL) || (params2 == NULL))
    {
        return CY_SROM_DR_INVALID_INPUT;
    }
//    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1','Checked manually. Intentional Non boolean type is interpreted as boolean.');
    IPC_STRUCT_Type* syscall_ipc_struct = Cy_IPC_Drv_GetIpcBaseAddress((uint32_t)CY_IPC_CHAN_SYSCALL);
    uint32_t timeOut = 0x00FFFFFFUL;

    // Copy input contents to SRAM reserved
    g_scratch.args = *params;
    g_scratch2     = *params2;

    // Make Bit[0] to 0, it indicates all arguments are passed through scratch address
    g_scratch.u32[0]  = g_scratch.u32[0]  & 0xFFFFFFFEUL;
    g_scratch2.arg[0] = g_scratch2.arg[0] & 0xFFFFFFFEUL;


