zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_srom.c
    message[0] = (uint32_t)&g_scratch;
    message[1] = (uint32_t)&g_scratch2;
    // Send message by IPC
    if (Cy_IPC_Drv_SendMsgDWord(syscall_ipc_struct, CY_SROM_DR_IPC_NOTIFY_STRUCT, message) != CY_IPC_DRV_SUCCESS)
    {
        // The IPC structure is already locked by another process
        return CY_SROM_DR_IPC_BUSY;
    }
    while(true)
    {
        // Checks if the IPC structure is not locked
        if (Cy_IPC_Drv_IsLockAcquired(syscall_ipc_struct) == false)
        {
            // The result of SROM API calling is in the SRAM reserved.
            // Copy the contents to the memory pointed by input pointer
            if(resp != NULL)
            {
                *resp = g_scratch.resps;
            }
            break;
        }

        // Decrement time out counter value
        timeOut--;

        // If time out counter is "0" return time out status
        if(timeOut == 0u)
        {
            return CY_SROM_DR_TIMEOUT;
        }
    }

    if(Cy_Srom_GetResponseType() == CY_SROM_RESPONSE_FAIL)
    {
        // If the SROM API returned an error in the scratch RAM, return error
        return CY_SROM_DR_API_ERROR;
    }
    else if(Cy_Srom_GetResponseType() == CY_SROM_RESPONSE_SUCCESS)
    {
        // If the SROM API returned "OK", return success
        return CY_SROM_DR_SUCCEEDED;
    }
    else
    {
        // Return unknown status
        return CY_SROM_DR_API_UNKNOWN;
    }
}

/*******************************************************************************
* Function Name: Cy_Srom_CallApi_NonBlock_2
****************************************************************************//**
*
* This function calls SROM API which need also IPC DATA1. Other is same as
* "Cy_SROM_CallApi_NonBlock_2"
*
* \param params
* Pointer to memory which contains SROM API arguments. The contents of arguments
* will be copied to "g_scratch". \ref un_srom_api_args_t
*
* \param params
* Pointer to memory which contains SROM API arguments 2. The contents of arguments
* will be copied to "g_scratch2". \ref un_srom_api_args_2_t
*
* \return
* \ref cy_en_srom_driver_status_t
*
*******************************************************************************/
cy_en_srom_driver_status_t Cy_Srom_CallApi_NonBlock_2(const un_srom_api_args_t* params, const un_srom_api_args_2_t* params2)
{
    if((params == NULL) || (params2 == NULL))
    {
        return CY_SROM_DR_INVALID_INPUT;
    }
//    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1','Checked manually. Intentional Non boolean type is interpreted as boolean.');
    IPC_STRUCT_Type* syscall_ipc_struct = Cy_IPC_Drv_GetIpcBaseAddress((uint32_t)CY_IPC_CHAN_SYSCALL);

    // Copy input contents to SRAM reserved
    g_scratch.args = *params;
    g_scratch2     = *params2;

    // Make Bit[0] to 0, it indicates all arguments are passed through scratch address
    g_scratch.u32[0]  = g_scratch.u32[0]  & 0xFFFFFFFEUL;
    g_scratch2.arg[0] = g_scratch2.arg[0] & 0xFFFFFFFEUL;

    message[0] = (uint32_t)&g_scratch;
    message[1] = (uint32_t)&g_scratch2;
    // Send message by IPC
    if (Cy_IPC_Drv_SendMsgDWord(syscall_ipc_struct, CY_SROM_DR_IPC_NOTIFY_STRUCT, message) != CY_IPC_DRV_SUCCESS)
    {
        // The IPC structure is already locked by another process
        return CY_SROM_DR_IPC_BUSY;
    }
    // Return succeeded status
    return CY_SROM_DR_SUCCEEDED;
}


/*******************************************************************************
* Function Name: Cy_Srom_GetResponseType
****************************************************************************//**
*
* This function returns status of SROM API response defined by \ref
* cy_en_srom_response_type_t
* Please call this function after "Cy_Srom_CallApi_NonBlock" was called.
*
* \return
* \ref cy_en_srom_response_type_t
*
*******************************************************************************/
cy_en_srom_response_type_t Cy_Srom_GetResponseType(void)
{
    if((g_scratch.u32[0] & 0xF0000000UL) == 0xA0000000UL)
    {
        return CY_SROM_RESPONSE_SUCCESS;
    }
    else if((g_scratch.u32[0] & 0xF0000000UL) == 0xF0000000UL)
    {
        return CY_SROM_RESPONSE_FAIL;
    }
    else
    {
        return CY_SROM_NOT_RESPONSE;
    }
}

/*******************************************************************************
* Function Name: Cy_Srom_Get_Api_Response
****************************************************************************//**
*
* This function returns g_scratch value as a response of SROM API.
* Please call this function after "Cy_Srom_CallApi_NonBlock" was called.
* "resp" is raw response data from SROM API on the other hands, return value
* indicate status of the response data like as invalid, succeeded, or failed.
* (if failed return value is same as resp.u32[0])
*
* \param resp
* Pointer to memory into which SROM API response to be copied if not NULL.
*  \ref un_srom_api_resps_t
*
* \return
* \ref cy_en_srom_api_status_t
*
*******************************************************************************/
cy_en_srom_api_status_t Cy_Srom_GetApiResponse(un_srom_api_resps_t* resp)
{
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 3, \
'Checked manually. Intentional expression The object pointer of type non "uint32_t *" is cast to type "uint32_t *".')
    SCB_InvalidateDCache_by_Addr ((uint32_t*)&g_scratch, (int32_t)sizeof(g_scratch));
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
    cy_en_srom_response_type_t type = Cy_Srom_GetResponseType();
    if(type == CY_SROM_NOT_RESPONSE)
    {
        return CY_SROM_STATUS_INVALID;
    }
    else
    {
        if(resp != NULL)
        {
            *resp = g_scratch.resps;
        }

        if(type == CY_SROM_RESPONSE_SUCCESS)
        {
            return CY_SROM_STATUS_SUCCESS;
        }
        else // CY_SROM_RESPONSE_FAIL
        {
            // return error code.
            return (cy_en_srom_api_status_t)g_scratch.u32[0];
        }
    }
}

