zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_flash_srom.c
/*******************************************************************************
* Function Name: Cy_Srom_ConvertRespToStatus
****************************************************************************//**
*
* This function returns g_scratch value as a response of SROM API.
* Please call this function after "Cy_Srom_CallApi_NonBlock" was called.
* "resp" is raw response data from SROM API on the other hands, return value
* indicate status of the response data like as invalid, succeeded, or failed.
* (if failed return value is same as resp.u32[0])
*
* \param resp
* Pointer to memory into which SROM API response to be copied if not NULL.
*  \ref un_srom_api_resps_t
*
* \return
* \ref cy_en_srom_api_status_t
*
*******************************************************************************/
cy_en_srom_api_status_t Cy_Srom_ConvertRespToStatus(uint32_t resp0)
{
    if((resp0 & 0xF0000000UL) == 0xA0000000UL)
    {
        return CY_SROM_STATUS_SUCCESS;
    }
    else if((resp0 & 0xF0000000UL) == 0xF0000000UL)
    {
        // Error Code
        return (cy_en_srom_api_status_t)resp0;
    }
    else
    {
        return CY_SROM_STATUS_INVALID;
    }
}

/*******************************************************************************
* Function Name: Cy_Srom_SetResponseHandler
****************************************************************************//**
*
* This function sets response handler which is supposed to be called when SROM
* API is complete.
*
* \param handler
* This will be invoked when SROM API finished and the IPC released.
*
*******************************************************************************/
void Cy_Srom_SetResponseHandler(cy_srom_handler handler)
{

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 3, \
'Checked manually. Intentional  expression "NvicMux3_IRQn" of type enum is used as an operand to the arithmetic operator "<<".')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 1, \
'Checked manually. Intentional  expression "NvicMux3_IRQn" of type enum is used as an operand to the arithmetic operator "<<".')
    const cy_stc_sysint_t irq_cfg = {
#if defined (CY_IP_M7CPUSS) || defined (CY_M4CPUSS_V2_IRQ_MUXING)
        /* Shift the interrupt source to the upper INTRSRC bits. */
        .intrSrc = (cy_sysint_int_src_t)((NvicMux3_IRQn << CY_SYSINT_INTRSRC_MUXIRQ_SHIFT) | CY_SROM_DR_IPC_INTR_NO),
#else
        .intrSrc = (IRQn_Type)(CY_SROM_DR_IPC_INTR_NO),
        #if (CY_CPU_CORTEX_M0P) && defined (CY_IP_M4CPUSS) && !defined (CY_M4CPUSS_V2_IRQ_MUXING)
        .cm0pSrc = (cy_en_intr_t) NvicMux3_IRQn,
        #endif
#endif
        .intrPriority = 2UL,
    };
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.4')
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1')
    /* set response handler */
    gp_srom_resp_handler = handler;

    /*  Set CPUSS interrupt    */
    cy_en_sysint_status_t sysStatus = Cy_SysInt_Init(&irq_cfg, Cy_Srom_ISR_ResponseIPC);
    if(CY_SYSINT_SUCCESS != sysStatus)
    {
        NVIC_EnableIRQ((IRQn_Type) NvicMux3_IRQn);
    }

    /*  Set IPC interrupt mask    */
    IPC_INTR_STRUCT_Type* sromRespIntrStr = Cy_IPC_Drv_GetIntrBaseAddr(CY_SROM_DR_IPC_INTR_STRUCT);

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1','Checked manually. Intentional Non boolean type is interpreted as boolean.');
    Cy_IPC_Drv_SetInterruptMask(sromRespIntrStr, (uint32_t)(1UL << (uint32_t)CY_IPC_CHAN_SYSCALL), 0UL);
}

/*******************************************************************************
* Function Cy_Srom_ISR_ResponseIPC
****************************************************************************//**
*
* This is interrupt handler called when SROM API was finished by CM0+ via IPC
* This function will be assigned in "Cy_Srom_SetResponseHandler".
*
*******************************************************************************/
static void Cy_Srom_ISR_ResponseIPC(void)
{
    uint32_t masked = 0;

    IPC_INTR_STRUCT_Type* sromRespIntrStr = Cy_IPC_Drv_GetIntrBaseAddr(CY_SROM_DR_IPC_INTR_STRUCT);
    masked = Cy_IPC_Drv_GetInterruptStatusMasked(sromRespIntrStr);

//    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1','Checked manually. Intentional Non boolean type is interpreted as boolean.');
    if((uint32_t)(masked & (uint32_t)(1UL << (uint32_t)CY_IPC_CHAN_SYSCALL)) != 0UL)
    {
        if(gp_srom_resp_handler != NULL)
        {
            gp_srom_resp_handler();
        }
    }

    Cy_IPC_Drv_ClearInterrupt(
                                sromRespIntrStr,
                                (masked & 0x0000FFFFUL),
                                (masked & 0xFFFF0000UL) >> 16UL
                              );
}
#if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
/*******************************************************************************
* Function Cy_Srom_Get_DataSize
****************************************************************************//**
*
* This returns the actual size in bytes based on the enumeration value passed.
*
*******************************************************************************/
static uint32_t Cy_Srom_Get_DataSize(cy_en_programrow_datasize_t size)
{
    uint32_t data_size;
    switch(size)
    {
        case CY_SROM_PROGRAMROW_DATA_SIZE_8BIT:
            data_size = 1u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_16BIT:
            data_size = 2u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_32BIT:
            data_size = 4u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_64BIT:
            data_size = 8u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_128BIT:
            data_size = 16u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_256BIT:
            data_size = 32u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_512BIT:
            data_size = 64u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_1024BIT:
            data_size = 128u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_2048BIT:
            data_size = 256u;
            break;
        case CY_SROM_PROGRAMROW_DATA_SIZE_4096BIT:
            data_size = 512u;
            break;
        default:
            data_size = 0u;
            break;
    }
    return data_size;
}

#endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
#endif /* CY_IP_M4CPUSS  CY_IP_M7CPUSS*/
